# GetSchedule Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleSheetInstance..::..GetSchedule Method
PanelScheduleSheetInstance Class See Also
---
Gets the panel schedule view.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public PanelScheduleView GetSchedule()
```

Visual Basic
---
```text
Public Function GetSchedule As PanelScheduleView
```

Visual C++
---
```text
public:
PanelScheduleView^ GetSchedule()
```

# ### Return Value
The panel schedule view element.
# See Also
PanelScheduleSheetInstance Class
Autodesk.Revit.DB.Electrical Namespace